In [1]:
import pandas as pd
from utils import (
    create_server_connection,
    create_database,
    create_db_connection,
    execute_query,
    read_query
)

In [2]:
def select_all_from(table, pw='password_of_localhost'):
    connection = create_db_connection('localhost', 'root', pw, db)
    results = read_query(connection, f'select * from {table}')
    from_db = []
    for result in results:
        from_db.append(list(result))
    df = pd.DataFrame(from_db)
    print(df)

In [3]:
pw = 'password'
db = 'mysql_python_'

connection = create_server_connection('localhost', 'root', pw)

MySQL Database connection sussefull.

In [4]:
create_db_query = f'create database if not exists {db}'

create_database(connection, create_db_query)

Database created successfully.

In [5]:
create_orders_table = """
create table if not exists orders(
    order_id int primary key,
    customer_name varchar(30) not null,
    product_name varchar(20) not null,
    date_ordered date,
    quantity int,
    unit_price float,
    phone_number varchar(20)
);
"""

# connect to the database
connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection, create_orders_table)

MySQL database connection successful
Query executed successfully.

In [6]:
# Insert data

data_orders = """
insert into orders values
    (101, 'steve', 'Laptop', '2018-06-12', 2, 800, '6293730802'),
    (102, 'Mehedi', 'Book', '2015-06-12', 10, 200, '57527522725'),
    (103, 'Hasan', 'Tshirt', '2018-08-12', 3, 60, '786543453453'),
    (104, 'Bijoy', 'pen', '2018-06-15', 5, 5, '527523752'),
    (105, 'Mehedi', 'Tshirt', '2018-06-12', 1, 50, '763435752'),
    (106, 'Nancy', 'Laptop', '2020-06-12', 1, 750, '2445633757'),
    (107, 'Kohli', 'Iphone 13', '2019-06-12', 4, 1000, '245722722');
"""

connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection, data_orders)

MySQL database connection successful
Query executed successfully.

In [7]:
# using the select statement

query = """
select * from orders;
"""

connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, query)

for result in results:
    print(result)

MySQL database connection successful
(101, 'steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(102, 'Mehedi', 'Book', datetime.date(2015, 6, 12), 10, 200.0, '57527522725')
(103, 'Hasan', 'Tshirt', datetime.date(2018, 8, 12), 3, 60.0, '786543453453')
(104, 'Bijoy', 'pen', datetime.date(2018, 6, 15), 5, 5.0, '527523752')
(105, 'Mehedi', 'Tshirt', datetime.date(2018, 6, 12), 1, 50.0, '763435752')
(106, 'Nancy', 'Laptop', datetime.date(2020, 6, 12), 1, 750.0, '2445633757')
(107, 'Kohli', 'Iphone 13', datetime.date(2019, 6, 12), 4, 1000.0, '245722722')

In [8]:
query = """
select customer_name, phone_number from orders;
"""

connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, query)

for result in results:
    print(result)

MySQL database connection successful
('steve', '6293730802')
('Mehedi', '57527522725')
('Hasan', '786543453453')
('Bijoy', '527523752')
('Mehedi', '763435752')
('Nancy', '2445633757')
('Kohli', '245722722')

In [9]:
query = """
select * from orders;
"""

connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, query)

from_db = []
for result in results:
    from_db.append(list(result))
    
columns = ['id', 'name', 'product', 'date', 'quantity', 'price', 'phone']
pd.DataFrame(from_db, columns = columns)

MySQL database connection successful

    id    name    product        date  quantity   price         phone
0  101   steve     Laptop  2018-06-12         2   800.0    6293730802
1  102  Mehedi       Book  2015-06-12        10   200.0   57527522725
2  103   Hasan     Tshirt  2018-08-12         3    60.0  786543453453
3  104   Bijoy        pen  2018-06-15         5     5.0     527523752
4  105  Mehedi     Tshirt  2018-06-12         1    50.0     763435752
5  106   Nancy     Laptop  2020-06-12         1   750.0    2445633757
6  107   Kohli  Iphone 13  2019-06-12         4  1000.0     245722722

In [10]:
# query = """
# select customer_name, phone_number, year(date_ordered) from orders;
# """
query = """
select * 
from orders
where year(date_ordered) = 2018
order by unit_price desc;
"""

connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, query)

for result in results:
    print(result)

MySQL database connection successful
(101, 'steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(103, 'Hasan', 'Tshirt', datetime.date(2018, 8, 12), 3, 60.0, '786543453453')
(105, 'Mehedi', 'Tshirt', datetime.date(2018, 6, 12), 1, 50.0, '763435752')
(104, 'Bijoy', 'pen', datetime.date(2018, 6, 15), 5, 5.0, '527523752')

In [11]:
# create a dataframe

from_db = []
for result in results:
    result = list(result)
    from_db.append(result)
columns = ['order_id', 'customer_name', 'product_name', 'date_ordered', 'quantity', 'unit_price', 'phone_number']

df = pd.DataFrame(from_db, columns = columns)
df

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,101,steve,Laptop,2018-06-12,2,800.0,6293730802
1,103,Hasan,Tshirt,2018-08-12,3,60.0,786543453453
2,105,Mehedi,Tshirt,2018-06-12,1,50.0,763435752
3,104,Bijoy,pen,2018-06-15,5,5.0,527523752

In [12]:
# update column

update = """
update orders set unit_price = 45
where order_id = 103
"""

connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection, update)

MySQL database connection successful
Query executed successfully.

In [13]:
query = """
select * 
from orders
where order_id = 103
"""

connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, query)

from_db = []
for result in results:
    from_db.append(list(result))

columns = ['id', 'name', 'product', 'date', 'quantity', 'price', 'phone']
pd.DataFrame(from_db, columns = columns)

MySQL database connection successful

    id   name product        date  quantity  price         phone
0  103  Hasan  Tshirt  2018-08-12         3   45.0  786543453453

In [14]:
# delete comman

delete_order = '''
delete from orders
where order_id = 105;
'''

connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection, delete_order)

MySQL database connection successful
Query executed successfully.